class welcome(object):
    def __init__(self):
        print('剑气分还合，荷珠碎复圆。万般皆是命，半点尽由天！')
        print('----------------------------------------')
        print('欢迎开始Lost迷失之旅！\n')

    def about(self):
        print('版本演化')
        print('----------------------------------------')
        print('lost Beta 0.1\n2017-11-6\n创建角色;初始化角色属性;初始化地图')
        print('----------------------------------------')
        print('lost Beta 0.2\n2017-11-7\n主菜单;地图指令;主程序')
        print('----------------------------------------')
        print('lost Beta 0.3\n2017-11-8\n优化地图指令;打印地图及当前位置')
        print('----------------------------------------')
        print('lost Beta 0.4\n2017-11-9\n初始化姓名，使用姓名字典文件;并且按性别自动生成姓名;人物优化')
        print('----------------------------------------')
        print('lost Beta 0.5\n2017-11-10\n优化命名程序;增加名字字典的存在判断')
        print('----------------------------------------')
        print('lost Beta 0.6\n2017-11-14\n代码重构;演化史编辑;随机三支线事件发生')
        print('----------------------------------------')
        print('谢谢观看')
